Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_PlaygroundBookFormatRef/PlaygroundBookFormatReference-level2.tmx
Source language: en_us
Languages: ja

source: Shows the live view when the playground opens.
ja: プレイグラウンドが開くときライブビューを表示する。

source: Similarly, page Name key value is the value of the Name key of the Manifest.plist file for the page.
ja: 同様に、page Name key valueは、そのページのためのManifest.plistファイルのNameキーの値です。

source: Some combinations of namespace and action include an optional comma-separated list of completions such as function names or module names.
ja: 名前空間とアクションの補完のあるものは、任意のコンマ区切りのリストでのいくらかの補完、例えば間数名やモジュール名などを含みます。

source: Some peripherals have Bluetooth characteristics that provide information about the peripheral’s battery charge level or firmware status.
ja: いくつかの周辺機器は、Bluetoothキャラクタリスティックを持ちます、それは周辺機器のバッテリー充電レベルまたはファームウェア状態についての情報を提供します。

source: Some web hosts have a file upload facility that lets you drag and drop a hierarchy of directories and files from your local filesystem.
ja: いくつかのウェブホストはファイルアップロード便宜を持ち、それはあなたにディレクトリおよびファイルの階層をあなたのローカルファイルシステムからドラッグ＆ドロップさせます。

source: Specially Named Files
ja: 特有名前ファイル

source: Speed up OpenGL ES or OpenGL playground book development.
ja: OpenGL ESまたはOpenGLプレイグラウンドブック開発をスピードアップします。

source: SpoilerButtonTitle Key
ja: SpoilerButtonTitleキー

source: Stops executing the current playground page.
ja: 現在のプレイグラウンドページの実行を停止します。

source: Store additional information and metadata about your feed in the format described below.
ja: あなたのフィードについての追加の情報とメタデータを下で記述される形式で格納してください。

source: Subscription Feed Format
ja: サブスクリプションフィード書式

source: Subscriptions
ja: サブスクリプション（定期購読、配信）

source: Subscripts
ja: 添え字

source: Support hardware game controller inputs.
ja: ハードウェアゲームコントローラ入力をサポートします。

source: Support peer-to-peer connectivity and the discovery of nearby devices.
ja: ピアトゥピア接続性と近くのデバイスの発見をサポートします。

source: Swift Playgrounds subscriptions live on the Internet as feeds.
ja: Swift Playgroundsサブスクリプションは、インターネット上にフィードとして置かれます。

source: SwiftVersion Key
ja: SwiftVersionキー

source: System Libraries
ja: システムライブラリ

source: Tapping in the placeholder area removes that text and shows the insertion point.
ja: プレースホルダーエリアにおいてタップすることで、そのテキストを削除して挿入ポイントを示します。

source: Tapping the button opens a popover that shows the hints.
ja: ボタンをタップすると、ポップオーバーが開いてヒントを示します。

source: Tapping the placeholder shows an insertion point.
ja: プレースホルダーをタップすると挿入ポイントを示します。

source: Tells the delegate that a connected peripheral is about to be disconnected.
ja: 接続された周辺機器がまさに切断されようとしていることをデリゲートに伝えます。

source: Tells the delegate that a new peripheral was discovered and can be displayed in the connection view.
ja: 新しい周辺機器が発見されて接続ビューにおいて表示可能なことをデリゲートに伝えます。

source: Tells the delegate that a peripheral has a firmware update available.
ja: 周辺機器が利用可能なファームウェアアップデートを持つことをデリゲートに伝えます。

source: Tells the delegate that a peripheral has been discovered during scanning.
ja: 周辺機器が走査している間に発見されたことをデリゲートに伝えます。

source: Tells the delegate that the central manager disconnected from a peripheral.
ja: セントラルマネージャがある周辺機器から切断されたことをデリゲートに伝えます。

source: Tells the delegate that the central manager established a connection with a peripheral.
ja: セントラルマネージャが周辺機器との接続を確立したことをデリゲートに伝えます。

source: Tells the delegate that the central manager failed to establish a connection with a peripheral.
ja: セントラルマネージャが周辺機器との接続を確立するのに失敗したことをデリゲートに伝えます。

source: Tells the delegate that the central manager is about to attempt to establish a connection with a peripheral.
ja: セントラルマネージャがまさにある周辺機器との接続の確立を試みようとしていることをデリゲートに伝えます。

source: Tells the delegate that the connection view needs a title to display for its current state.
ja: 接続ビューがそれの現在の状態に対して表示するタイトルを必要としていることをデリゲートに教えます。

source: Tells the delegate that the state of the central manager has changed.
ja: セントラルマネージャの状態が変更されたことをデリゲートに伝えます。

source: Term Name
ja: 用語名

source: Term Name Key
ja: 用語名キー

source: Term name keys can contain spaces.
ja: 用語名キーは空白を含むことができます。

source: Terms Key
ja: Termsキー

source: Text on the same line as the opening comment delimiter is ignored.
ja: 開きコメント区切り記号と同じ行でのテキストは無視されます。

source: The delimiter is preceded by two forward slash characters followed by a colon and a pound sign (//:#).
ja: 区切り記号は、２つのスラッシュに続けてコロンとポンド記号（//:#）を前に置きます。

source: The Manifest.plist file for a book contains the following key-value pairs specifying the attributes for a book:
ja: ブックのためのManifest.plistファイルは、ブックの属性を指定している以下のキー値ペアを含みます：

source: The Manifest.plist file for a chapter contains the following key-value pairs specifying the attributes for a chapter:
ja: ある章のためのManifest.plistは、以下のキー値ペアを含んでいて、ある章の属性を指定します：

source: The Manifest.plist file for a cutscene page contains the following key-value pairs specifying the attributes for a cutscene:
ja: カットシーンページのためのManifest.plistファイルは、以下のキー値ペアを含んでいて、あるカットシーンの属性を指定します：

source: The Manifest.plist file for a playground page contains the following key-value pairs specifying the attributes for a page:
ja: プレイグラウンドページのためのManifest.plistファイルは、以下のキー値ペアを含んでいて、あるページの属性を指定します：

source: The Prose.strings file contains a list of key-value pairs along with optional comments describing the purpose of each key-value pair.
ja: Prose.stringsファイルは、キー値ペアのリスト、それに加えて各キー値ペアの目的を解説する任意のコメントを含みます。

source: The localized delimiter takes a single labeled key argument, for the identifier corresponding to a localization key in the Prose.strings file.
ja: localized区切り記号は、ただ１つのラベル付きkey引数を、Prose.stringsファイルの中のローカライズキーに対応している識別子に対して取ります。

source: The copy-destination delimiter takes two arguments, the name of the source page and the identifier of the code to be copied.
ja: copy-destination区切り記号は、２つの引数、ソースページの名前とコピーされることになるコードの識別子をとります。

source: The copy-source delimiter takes a single argument, the identifier of the content, which is enclosed by parentheses.
ja: copy-source区切り記号は、ただ１つの引数、その内容の識別子をとります、それは丸括弧によって囲まれます。

source: The setupPlaygroundPage function call is hidden by the surrounding hidden code delimiters.
ja: setupPlaygroundPage関数呼び出しは、非表示コード区切り記号で囲むことによって隠されます。

source: The identifier namespace selects symbols using the syntax you use when referencing a symbol in Swift code, such as randomInt(from:to:).
ja: identifier名前空間は、シンボルを選択するのにあなたがSwiftコードにおいてシンボルを参照する時に使う構文を使います、例えばrandomInt(from:to:)など。

source: The description namespace selects symbols using the names for completions displayed in the shortcut bar, such as randomInt(from: Int, to: Int).
ja: description名前空間は、シンボルを選択するのにショートカットバーにおいて表示される補完のための名前を使います、例えばrandomInt(from: Int, to: Int)など。

source: The link text is displayed as a link on the playground page.
ja: link textは、プレイグラウンドページ上でリンクとして表示されます。

source: The placeholder name is a string that can include whitespace and special characters.
ja: placeholder nameは１つの文字列で、空白と特殊文字を含むことが出来ます。

source: The term key is a Term Name Key for a glossary term in the Glossary.plist file.
ja: termキーは、Glossary.plistファイルの中のあるグロッサリー用語のための用語名キーです。

source: The Format of a Book’s Metadata
ja: ブックの持つメタデータの書式。

source: The Format of a Feed’s Documents
ja: フィードのもつ書類の書式

source: The Hint button is replaced by a completion button.
ja: Hintボタンは、完了ボタンによって置き換えられます。

source: The ISO 8601-formatted date when you first published the book.
ja: あなたが最初にブックを出版した時の、ISO 8601書式化された日付。

source: The ISO 8601-formatted date when you last updated the book.
ja: あなたが最後にブックを更新した時の、ISO 8601書式化された日付。

source: The JSON you'll see used by apps is typically longer, but those longer JSON documents follow the same rules of quoting and nesting.
ja: あなたがアプリによって使われるのを見るだろうJSONは大抵もっと長いです、しかしそれら長いJSON文書は同じクォーティングおよび入れ子の規則に従います。

source: The PlaygroundBluetooth framework provides a common interface that you use to display and manage connections to Bluetooth peripherals from the framework’s central manager within a playground page.
ja: PlaygroundBluetoothフレームワークは、ある一般インターフェイスを提供します、それはBluetooth周辺機器への接続を、フレームワークのセントラルマネージャから得て、プレイグラウンドページ内部において表示および管理するためにあなたが使います。

source: The SHA-512 hash of the ZIP-compressed version of the book.
ja: ブックのZIP圧縮バージョンのSHA-512ハッシュ。

source: The Swift Playgrounds universal link prefix: https://developer.apple.com/ul/sp0?url=.
ja: Swift Playgroundsユニバーサルリンク接頭辞：https://developer.apple.com/ul/sp0?url=。

source: The Top-Level Structure of a Subscription’s Feed
ja: サブスクリプションのもつフィードのトップレベル構造

source: The URI can appear anywhere in text that is inside markup comment delimiters.
ja: URIは、マークアップコメント区切り記号の内部にあるテキスト中のどこにでも現れることができます。

source: The URL for your subscription's JSON feed.
ja: あなたのサブスクリプションの持つJSONフィードに対するURL。

source: The absence of an error indicates that the disconnection was requested via the manager’s disconnect(from:) method.
ja: エラーの不在は、切断がマネージャの持つdisconnect(from:)メソッド経由で要求されたことを指し示します。

source: The active live view, if any; otherwise nil.
ja: アクティプなライブビュー、もしあれば；そうでなければnil。

source: The advertisement data you use to help decide how to display the peripheral.
ja: 告知データ、あなたはどのようにその周辺機器を表示するか決める助けとしてそれを使います。

source: The advertisement data you use to help decide whether or not to display the peripheral.
ja: 告知データ、あなたはその周辺機器を表示するかどうか決める助けとしてそれを使います。

source: The amount of time, in seconds, before the connection attempt is aborted.
ja: 接続の試みが中断される前の時間、秒数で。

source: The area is expanded to display the message.
ja: この領域は、メッセージを表示するために広げられます。

source: The area of the live view that is not covered by other Swift Playgrounds user interface elements.
ja: 他のSwift Playgroundsユーザインターフェイス要素によってカバーされないライブビューの領域。

source: The assessment status for the page, if any; otherwise nil.
ja: このページに対する評価状態、もしあれば；そうでなければnil。

source: The associated value is a UIView that is the root of a view hierarchy (it does not have a superview), and it is not owned by a view controller.
ja: 関連値はUIViewで、それはビュー階層のルート（それはスーパービューを持ちません）です、そしてそれはビューコントローラによって所有されません。

source: The associated value is a UIViewController that is the root of a view controller hierarchy (it does not have a parent view controller), and its view does not have a superview.
ja: 関連値はUIViewControllerで、それはビュー階層のルート（それはスーパービューを持ちません）です、そしてそれはビューコントローラによって所有されません。

source: The base name of an image file that is shown centered and unscaled in the live view area before the live view runs.
ja: ライブビューが動作する前にライブビューエリアにおいて真ん中にサイズ調節されずに表示されるある画像ファイルのベース名。

source: The book package can contain multiple resolutions of the same image.
ja: ブックパッケージは、複数の解像度の同じ画像を含むことができます。

source: The book package, chapters, and pages use folder name extensions to indicate their type.
ja: ブックパッケージ、章、そしてページは、フォルダ名拡張子を使ってそれらの型を指し示します。

source: The books, chapters, and pages include manifest information and optional items shared between the book, chapter, or page.
ja: ブック、章、そしてページは、マニフェスト情報および、ブック、章、またはページ間で共有される任意の項目を含みます。

source: The bounds of the frame for the safe area depend on the setting of the LiveViewEdgeToEdge key for the current page.
ja: 安全領域のためのフレームの境界は、現在のページに対するLiveViewEdgeToEdgeキーの設定に依存します。

source: The bundle ID, a unique identifier string for the book in reverse DNS format.
ja: バンドルID、ブックのための逆DNS形式での特有識別子文字列。

source: The central manager attempting the new connection.
ja: 新しい接続を試みているセントラルマネージャ。

source: The central manager providing this information.
ja: この情報を提供しているセントラルマネージャ。

source: The central manager scans for and connects to nearby Bluetooth peripherals.
ja: セントラルマネージャは、近くのBluetooth周辺機器を走査して接続します。

source: The central manager that disconnected from a peripheral.
ja: 周辺機器から切断されたセントラルマネージャ。

source: The central manager that failed to make the new connection.
ja: 新しい接続を作るのに失敗したセントラルマネージャ。

source: The central manager that made the new connection.
ja: 新しい接続を作ったセントラルマネージャ。

source: The central manager whose peripherals will be displayed in the view.
ja: それの周辺機器がビューにおいて表示される、セントラルマネージャ。

source: The code contains a function call to set up the page, modify the code completion choices shown in the shortcut bar, and add an editable code area.
ja: このコードはある関数呼び出しを含むことで、ページの設定、ショートカットバーにおいて示されるコード補完選択肢の修正、そして編集可能コードエリアの追加を行います。

source: The code on lines 8-12, which is inside the hidden code delimiters, is not shown on the playground page.
ja: 行８-１２でのコード、非表示区切り記号の内側にあるものは、プレイグラウンドページで表示されません。

source: The code-completion delimiter adds or removes a symbol or group of symbols from the list of possible completions.
ja: コード補完区切り記号は、可能な補完のリストからあるシンボルまたはシンボルのグループを加えたり削除したりします。

source: The code-completion delimiter, code-completion, is preceded by two forward slash characters followed by a pound sign and a hyphen(//#-), and appears on a line by itself, with no preceding whitespace characters.
ja: コード補完区切り記号、code-completionは、２つのフォワードスラッシュ文字とそれに続くポンド記号とハイフン（//#-）を前に置いて、そして先行する空白文字なしで、単独で１つの行に現れます。

source: The connection to a peripheral has been lost.
ja: ある周辺機器への接続が失われてしまった。

source: The connection view currently displaying the connection to this peripheral.
ja: この周辺機器への接続を現在は表示している接続ビュー。

source: The connection view displays status information about nearby peripherals; use it to provide a consistent interface across different playground books.
ja: 接続ビューは、近くの周辺機器についての状況情報を表示します；それを使って異なるプレイグラウンドブックに渡り首尾一貫したインターフェイスを提供します。

source: The connection view showing available peripherals.
ja: 利用可能な周辺機器を示している接続ビュー。

source: The connection view that’s entering this state.
ja: この状態に入る予定の接続ビュー。

source: The connection view title corresponding to this state should be in one of the following format: "Select a \(item.name)" or "Select several \(item.name)s".
ja: この状態に対応する接続ビュータイトルは、以下の形式のうちの１つでなければなりません："Select a \(item.name)" または "Select several \(item.name)s"。

source: The connection view title corresponding to this state should be in one of the following formats: "Searching for \(item.name)" or "Searching for \(item.name)s".
ja: この状態に対応する接続ビュータイトルは、以下の形式のうちの１つでなければなりません："Searching for \(item.name)" または "Searching for \(item.name)s"。

source: The connection view title corresponding to this state should be in the following format: "Connect \(item.name)"
ja: この状態に対応する接続ビュータイトルは、以下の形式でなければなりません："Connect \(item.name)"

source: The connection view title corresponding to this state should be in the following format: "Connect to a Different \(item.name)".
ja: この状態に対応する接続ビュータイトルは、以下の形式でなければなりません："Connect to a Different \(item.name)"。

source: The connection view title corresponding to this state should be in the following format: "Connecting \(item.name)".
ja: この状態に対応する接続ビュータイトルは、以下の形式でなければなりません："Connecting \(item.name)"。

source: The contact URL you use to get information about and report problems with the feed.
ja: このフィードについての情報取得や問題報告のためにあなたが使う連絡URL。

source: The content developer's version number for the book.
ja: ブックのためのコンテンツの開発者用バージョン番号。

source: The content is added as a hint that is hidden by a Show Solution button.
ja: 内容はヒントの１つとして加えられます、それはShow Solutionボタンによって隠されます。

source: The contents of the folders are shared by the level in the hierarchy at which they are defined and all levels below that.
ja: それらフォルダの内容は、そこでそれらが定義される階層の中のそのレベルおよびそれより下の全てのレベルによって共有されます。

source: The current contents of the playground page, including any user-entered text.
ja: プレイグラウンドページの現在の内容、あらゆるユーザ入力テキストを含みます。

source: The current format version is "1.0".
ja: 現在の書式バージョンは、"1.0"です。

source: The current key-value store.
ja: 現在のキー値保管庫。

source: The current playground page.
ja: 現在のプレイグラウンドページ。

source: The current received signal strength indicator of the peripheral in decibels.
ja: デシベルでの周辺機器の現在の受信信号強度表示器。

source: The current state of the central manager.
ja: セントラルマネージャの現在の状態。

source: The currently connected peripheral has outdated firmware and cannot be used.
ja: 現在接続される周辺機器は、旧式のファームウェアを持ち、使用できません。

source: The default language and region for the book, as a Language ID.
ja: このブックのための省略時の言語と地域、Language IDとして。

source: The default language and region for the book.
ja: このブックのための省略時の言語と地域。

source: The default value is false.
ja: 省略時の値は、falseです。

source: The default value is "string".
ja: 省略時の値は"string"です。

source: The definition for the glossary term, as a string.
ja: グロッサリー用語のための定義、文字列として。

source: The definition for the glossary term.
ja: グロッサリー用語のための定義。

source: The definition is displayed in the full glossary and in the glossary term popover.
ja: 定義は、完全なグロッサリーでおよびグロッサリー用語ポップオーバーで定義として表示されます。

source: The delimiters on lines 1 and 3-6 are not shown on the playground page.
ja: 行１と３-６上の区切り記号は、プレイグラウンドページ上では表示されません。

source: The difficulty level of the material taught in the book.
ja: ブックにおいて学ばせる題材の難易度レベル。

source: The dispatch queue used to dispatch events to the central manager’s delegate.
ja: セントラルマネージャの持つデリゲートにイベントを発送するために使われるディスパッチキュー。

source: The display name of the book in the user interface; for example, the name of the book in the table of contents.
ja: ユーザインターフェイスにおけるブックの表示名；例えば、目次におけるブックの名前。

source: The display name of the chapter in the user interface; for example, the name of a chapter in the table of contents.
ja: ユーザインターフェイスにおけるその章の表示名；例えば、目次におけるある章の名前。

source: The display name of the cutscene page in the user interface; for example, the name of a cutscene in the table of contents.
ja: ユーザインターフェイスにおけるそのカットシーンの表示名；例えば、目次におけるあるカットシーンの名前。

source: The display name of the playground page in the user interface; for example, the name of a page in the table of contents.
ja: ユーザインターフェイスの中のプレイグラウンドページの表示名；例えば、目次でのあるページの名前。

source: The downcast succeeds if a live view that supports the PlaygroundLiveViewMessageHandler Protocol is executing.
ja: PlaygroundLiveViewMessageHandler Protocolをサポートするライブビューが実行されているならばダウンキャウトは成功です。

source: The downcasted object gives access to the remote always-on live view by a forced downcast of the current live view.
ja: ダウンキャストされたオブジェクトは、リモートの常時接続ライブビューへのアクセスを、現在のライブビューの強制ダウンキャストによって提供します。

source: The editable area is defined on line 3 of the source code for the page, as shown in Listing 7-1.
ja: 編集エリアは、コード出力 7-1で示すように、このページのためのソースコードの行３で定義されます。

source: The editable areas that copy code from the previous page are defined on lines 1, 3, and 5 of the source code for the page, as shown in Listing 7-4.
ja: コードを前のページからコピーする編集エリアは、コード出力 7-4で示すように、このページのためのソースコードの行１、３、そして５で定義されます。

source: The editable areas with copied code are defined on lines 2, 5, and 6 of the source code for the page, as shown in Listing 7-3.
ja: コピーされるコードを持つ編集エリアは、コード出力 7-3で示すように、このページのためのソースコードの行２、５、そして６で定義されます。

source: The editable code placeholder text “Tap to enter code” is the result of defining the editable area on lines 5 and 6.
ja: 編集可能コードプレースホルダーテキスト「Tab to enter code」は、行５と６上での編集エリアの定義の結果です。

source: The entry for each glossary term has three parts, as shown in Figure 13-1:
ja: 各グロッサリー用語のための登録項目は、図 13-1で示されるように、３つの部分を持ちます：

source: The enumeration you use to indicate whether a peripheral’s firmware is current.
ja: ある周辺機器のファームウェアが最新かどうかを指し示すためにあなたが使用する列挙。

source: The error that occurs when a peripheral connection to the central manager fails.
ja: セントラルマネージャへのある周辺機器接続が失敗する場合に起こるエラー。

source: The error that occurs when a peripheral fails to connect to the central manager before the timeout period expires.
ja: ある周辺機器がセントラルマネージャへの接続に、時間切れ期間が満了する前に失敗する場合に起こるエラー。

source: The error that occurs when a peripheral fails to connect to the central manager.
ja: ある周辺機器がセントラルマネージャへの接続に失敗する場合に起こるエラー。

source: The error that occurs when a peripheral rejects a connection to the central manager because there are too many others.
ja: ある周辺機器がセントラルマネージャに対するある接続を、他のものが多すぎるので断る場合に起こるエラー。

source: The error that occurs when the central manager is in a state that can’t make connections.
ja: セントラルマネージャが接続されることが出来ない状態にある場合に起こるエラー。

source: The errors you may encounter when connecting a peripheral to the central manager for the current playground page.
ja: ある周辺機器を現在のプレイグラウンドページのためのセントラルマネージャに接続する時にあなたが出くわすかもしれない様々なエラー。

source: The errors you may encounter when connecting a peripheral to the central manager.
ja: ある周辺機器をセントラルマネージャに接続する時にあなたが出くわすかもしれない様々なエラー。

source: The example below shows a HTML link surrounded by a descriptive sentence:
ja: 下の例は、説明文によって囲まれるHTMLリンクを示します：

source: The example below shows a conformance to this protocol that uses images from a playground book’s Public and Private Resources Folders.
ja: 下の例は、このプロトコルへの準拠を示します、それはプレイグラウンドブックの持つPublic and Private Resources Foldersから画像を使用します。

source: The example below shows how to configure the types in the PlaygroundBluetooth framework to connect to peripherals after you implement the delegates and data source described in this chapter.
ja: 下の例は、PlaygroundBluetoothフレームワークの中の様々な型を構成設定して、あなたがこの章で記述されるデリゲートとデータソースを実装した後で、周辺機器に接続する方法を示します。

source: The example below shows how to use the different states as part of adopting the PlaygroundBluetoothConnectionViewDelegate protocol.
ja: 下の例は、PlaygroundBluetoothConnectionViewDelegateプロトコルへの採用の一環としてこの様々な状態をどのように使うかを示します。

source: The example document isn't detailed enough to be a real feed for a playground subscription, but it illustrates the kind of information a feed contains.
ja: この例の文書は、プレイグラウンドサブスクリプションのための実際のフィードであるのに十分な詳細を持ちません、しかしそれはフイードが含むような情報を例示します。

source: The feed for your subscription is a way for you publish a set of playgrounds that the Swift Playgrounds app knows how to download, process, and display.
ja: あなたのサブスクリプションのためのフィードは、Swift Playgroundsアプリがダウンロード、処理、そして表示する方法を知っている一揃いのプレイグラウンドをあなたが出版するための１つの方法です。

source: The feed format used by Swift Playgrounds meets these two characteristics: feeds have some details (metadata) used to name, describe, and identify the subscription; feeds also contain a link to each individual playground book in a subscription.
ja: Swift Playgroundsによって使われるフィード書式はこれら２つの特徴を兼ね備えます：フィードはそのサブスクリプションを命名、説明、そして識別するために使われるいくつかの細目（メタデータ）を持ちます；フィードはまたあるサブスクリプションの中の個々のプレイグラウンドそれぞれへのリンクを含みます。

source: The file is located at the top level of the .cutscenepage folder for the page.
ja: このファイルは、そのページのための.cutscenepageフォルダの最上位に位置します。

source: The file is located at the top level of the .playgroundpage folder for the page.
ja: このファイルは、そのページのための.playgroundpageフォルダの最上位に位置します。

source: The file is located in the .playgroundchapter folder for the chapter.
ja: このファイルは、その章のための.playgroundchapterフォルダに位置します。

source: The file is located in the Contents folder inside the top-level .playgroundbook folder.
ja: このファイルは、最上位.playgroundbookフォルダ内部のContentsフォルダの中に位置します。

source: The file path for a text file in the Resources folder that contains the hint text shown in the popover.
ja: Resourcesフォルダの中のあるファイルに対するファイルパスで、ポップオーバーにおいて表示されるヒントテキストを含みます。

source: The file path for the main page of a cutscene.
ja: あるカットシーンのためのメインページへのファイルパス。

source: The file path is relative to the PrivateResources folder of the cutscene page; this folder must contain the HTML file.
ja: ファイルパスはカットシーンページのPrivateResourcesフォルダに相対的です；このフォルダはHTMLファイルを含まなければなりません。

source: The file path is relative to the Resources folder of the page.
ja: ファイルパスはページのResourcesフォルダに相対的です。

source: The file path to the main HTML file for a cutscene.
ja: あるカットシーンのためのメインHTMLファイルへのファイルパス。

source: The first argument, namespace, specifies the space of possible symbols.
ja: 最初の引数、namespaceは、可能なシンボルの空間を指定します。

source: The first step in development is creating a skeleton structure for the book.
ja: 開発における第一段階は、ブックのための骨組構造を作成することです。

source: The following code checks if the text of the playground page contains one of the strings “llama” or “Llama”.
ja: 以下のコードは、プレイグラウンドのテキストが文字列「llama」または「Llama」のうちの１つを含むかどうかを調べます。

source: The following example code shows the playground page using a proxy for the live view to set up a message listener.
ja: 以下の例コードは、ライブビューのためのプロキシを使ってプレイグラウンドページを示して、メッセージリスナーを準備します。

source: The following example creates a dictionary and adds it to the key-value store of a playground book.
ja: 以下の例はあるディクショナリを作成します、そしてそれをプレイグラウンドブックのキー値保管庫に加えます。

source: The following example creates an array and adds it to the key-value store of a playground book.
ja: 以下の例はある配列を作成します、そしてそれをプレイグラウンドブックのキー値保管庫に加えます。

source: The following example receives a dictionary with a command from a remote object.
ja: 以下の例は、リモートオブジェクトからのコマンドを持つディクショナリを受け取ります。

source: The following example sets one hint for the page.
ja: 以下の例は、１つのヒントをページに設定します。
